{
  "currency.setting.currency.name": "Currency name",
  "currency.setting.code": "Code",
  "currency.setting.rate.apply.date": "Effective Date",
  "currency.setting.effective.rate": "Current Rate",
  "currency.setting.auto.rate": "Automatic exchange rate",
  "currency.setting.cancel.auto.update": "Whether to cancel automatically update the exchange rate?",
  "currency.setting.reality.deviate": "Maximum exchange rate deviation:",
  "currency.setting.deviate.not.empty": "Warning rate should be integer",
  "currency.setting.deviate.warn": "%->warning,",
  "currency.setting.forbidden.not.empty": "Forbidden rate should be integer",
  "currency.setting.forbidden.rate": "%->unable to save.",
  "currency.setting.enable.auto.rate": "Enable automatic exchange rate:",
  "currency.setting.enable.rate.note": "Enabling exchange rate instructions:",
  "currency.setting.without.duty": "This automatic exchange rate information is for reference only, and Helios does not assume any responsibility for the results of using the exchange rate data.",
  "currency.setting.add.new.enable": "enable",
  "currency.setting.add.new.rate": "new currency",
  "currency.setting.cancel.edit": "Cancel",
  "currency.setting.batch.edit.rate": "Modify exchange rate collectively",
  "currency.setting.agree": "Agree & Continue",
  "currency.setting.refuse": "Deny",
  "currency.setting.enable.agreement": "Helios Automatic Exchange Rate Activation Service Agreement",
  "currency.setting.agreement.click": "Helios Automatic Exchange Rate Service Agreement (agreement) is an agreement between the users and Helios on automatic exchange rate services, please user management read this activation agreement carefully. Once clicked",
  "currency.setting.agree.continue": "'“Agree & Continue” '",
  "currency.setting.agree.observe": "button means user is deemed to have accepted and agreed to abide by the terms of this agreement.",
  "currency.setting.agreement.1": "1. Confirmation and Acceptance of Agreement",
  "currency.setting.agreement.1.1": "1.1 The ownership and operation rights of this agreement are owned by Helios.",
  "currency.setting.agreement.1.2": "1.2 This agreement is in effect once user agreed and the automatic exchange rate service will be provided to user.",
  "currency.setting.agreement.1.3": "1.3 Helios reserves the right to refuse service under special circumstances of this product.",
  "currency.setting.agreement.1.4": "1.4 When user use this service provided by Helios, he/she should also accept the standard criteria or features on this service.",
  "currency.setting.agreement.2": "2. Agreement Service",
  "currency.setting.agreement.2.1": "2.1 The source of Helios automatic exchange rate data is the exchange rate data provided by",
  "currency.setting.third.party": "the third-party statistics ",
  "currency.setting.europe.data": "of the European Central Bank.",
  "currency.setting.agreement.2.2": "2.2 The validity and accuracy of the data of the automatic exchange rate of Helios is based on the data provided by the European Central Bank interface.",
  "currency.setting.agreement.2.3": "2.3 The Helios exchange rate service is subject to the European Central Bank’s automatic exchange rate service.",
  "currency.setting.agreement.2.4": "2.4 The exchange rate is scheduled to be automatically updated daily at 8:00 AM Beijing time.",
  "currency.setting.agreement.2.5": "2.5 Helios automatic exchange rate can be used in daily business activities of users, but it is only for reference.",
  "currency.setting.agreement.3": "3. User’s Obligation to This Agreement",
  "currency.setting.law.duty": "This agreement is formulated in accordance with relevant national laws, regulations, and rules. Users agree to strictly abide by the following obligations：",
  "currency.setting.agreement.3.1": "3.1 The automatic exchange rate is only used as the reference exchange rate of this product, providing reference for the user’s business activities, and cannot be used as other commercial or dissemination.",
  "currency.setting.agreement.4": "4. Limitation of Liability and Unsecured Guarantee",
  "currency.setting.agreement.4.1": "4.1 Unless there is other expressly stated in writing, the data provided by this AFC Agreement is provided on a “as is” and “as available” basis.",
  "currency.setting.agreement.4.2": "4.2 Unless there is other expressly stated in writing, Helios does not make any express or implied representations or warranties on the automatic exchange rate data (as otherwise provided by the laws if the People’s Republic of China).",
  "currency.setting.agreement.4.3": "4.3 If the automatic exchange rate cannot be used or updated due to other reasons beyond the control of Shanghai Link, Helios does not bear the corresponding responsibility, but allows user to switch off the automatic exchange rate on its own.",
  "currency.setting.agreement.4.4": "4.4 Helios automatic exchange rate data is for reference only. The result of the use of the exchange rate data by customers will not be responsibility of Helios.",
  "currency.setting.agreement.5": "5. Agreement Update and User Concern Obligations",
  "currency.setting.agreement.5.1": "5.1  In accordance with the changes in national laws and regulations and operational requirements, Helios shall have the right to modify the terms of this agreement from time to time. The revised agreements will become effective once it is posted on the site, and will replace the original agreement.",
  "currency.setting.agreement.5.2": "5.2  User can login at any time to check the latest agreement; user is obliged to pay attention to and read the latest version of the agreement, other terms and announcements from time to time. If user disagree with the updated agreement, it may and should immediately stop accepting the Helios automatic exchange rate service.",
  "currency.setting.agreement.5.3": "5.3  If user continues to use the automatic exchange rate service, it is deemed to have agreed to the updated agreement. Helios advised users to read this agreement and announcement before using this automatic exchange rate service. If any item of this agreement is deemed to be annulled, invalid or unenforceable for any reason, the item shall be deemed to be separable without affecting the validity and enforceability of any remaining items.",
  "currency.setting.agreement.6": "6. Justification and Application of Laws",
  "currency.setting.agreement.law": "The execution and interpretation of this agreement and the settlement of disputes shall apply to the applicable laws that applying to the mainland of the People’s Republic of China (excluding its conflict of laws rules). If this agreement occurs in contradiction with the applicable law, these terms will be fully re-interpreted in accordance with the laws and other provisions will continue to be valid. If there is any dispute between the Contracting Party on the content of this arrangement or its implementation, both parties shall try their best to settle it through friendly negotiation; when the negotiation fails, either party may bring a lawsuit to the People’s Court of the lace where the agreement is signed. This agreement was signed in Putuo District, Shanghai, the People’s Republic of China.",
  "currency.setting.agreement.7": "7. Others",
  "currency.setting.agreement.7.1": "7.1  Helios owner is referring to the business entity of Helios website that is legally permitted or filed in government departments.",
  "currency.setting.agreement.7.2": "7.2  Kindly read carefully with the terms in this agreement that are marked in bold, underlined, italic and etc.",
  "currency.setting.agreement.7.3": "7.3  The user clicks the “Agree & Continue” button underneath this agreement is deemed to be completely accepted by the user. Before clicking, user is required to confirm again and fully understand the entire contents of this agreement.",
  "currency.setting.add.rate": "Successful operation",
  "currency.setting.add.foreign.currency": "Foreign currency",
  "currency.setting.add.currency": "Local currency",
  "currency.setting.add.edit.time": "Action on",
  "currency.setting.add.enable.influence": "Enable this currency may cause some failure in existing document.",
  "currency.setting.add.continue.update": "Confirm",
  "currency.setting.add.cancel.update": "Cancel",
  "currency.setting.add.enable.success": "Successful operation",
  "currency.setting.add.forbid.influence": "Disable this currency may cause some failure in existing document.",
  "currency.setting.add.edit.confirm": "Are you sure?",
  "currency.setting.add.edit.rate": "Edit",
  "currency.setting.add.change.rate": "Edit",
  "currency.setting.add.rate.history": "History rate",
  "currency.setting.add.clear.search": "Clear",
  "currency.setting.add.edit.history": "Change history rate",
  "currency.setting.add.enable.auto.rate": "Current set of book or A/C has not been enabled with the automatic exchange rate update service. Please turn it on first!",
  "currency.setting.number.zero": "Effective exchange rate must be greater than zero",
  "currency.setting.data.not.repeat": "Cannot save duplicate data",
  "currency.setting.can.not.change": "Modifying exchange rate by batch in progress, not allow to switch page"
}